In [1]:
import csv

f = open("alunos.csv", "r", encoding="utf-8")

leitor = csv.reader(f, delimiter=";", lineterminator="\n")

planilha = []

for linha in leitor:
    planilha.append(linha)

f.close()

planilha

[['RA', 'Nome', 'Frequência', 'Prova1', 'Prova2', 'Prova3', 'Prova4'],
 ['110236', 'Adriana', '20', '8', '8', '8', '8'],
 ['110271', 'Maria', '19', '9.5', '8', '7', '10'],
 ['110263', 'José', '20', '5', '6.5', '7', '5']]

In [2]:
# forma condensada

with open("alunos.csv", "r", encoding="utf-8") as f:
    
    planilha = [linha for linha in csv.reader(f, delimiter=";", lineterminator="\n")]
    
planilha

[['RA', 'Nome', 'Frequência', 'Prova1', 'Prova2', 'Prova3', 'Prova4'],
 ['110236', 'Adriana', '20', '8', '8', '8', '8'],
 ['110271', 'Maria', '19', '9.5', '8', '7', '10'],
 ['110263', 'José', '20', '5', '6.5', '7', '5']]

In [3]:
[item[0] for item in planilha]

['RA', '110236', '110271', '110263']

In [4]:
[item[1] for item in planilha]

['Nome', 'Adriana', 'Maria', 'José']

In [5]:
aluno = input("Digite o nome do aluno para calcular a média! ")

lista_aluno = [item[1] for item in planilha]

indice = lista_aluno.index(aluno)

dados_aluno = planilha[indice]

nota1 = float(dados_aluno[3])
nota2 = float(dados_aluno[4])
nota3 = float(dados_aluno[5])
nota4 = float(dados_aluno[6])
media = (nota1+nota2+nota3+nota4)/4

print(f"A média de {aluno} é {media}")

Digite o nome do aluno para calcular a média! Maria
A média de Maria é 8.625

In [6]:
# forma condensada

aluno = input("Digite o nome do aluno para calcular a média! ")

dados_aluno = planilha[[item[1] for item in planilha].index(aluno)]

nota1 = float(dados_aluno[3])
nota2 = float(dados_aluno[4])
nota3 = float(dados_aluno[5])
nota4 = float(dados_aluno[6])
media = (nota1+nota2+nota3+nota4)/4

print(f"A média de {aluno} é {media}")

Digite o nome do aluno para calcular a média! Maria
A média de Maria é 8.625

In [7]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\rodsp\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\rodsp\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\rodsp\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\rodsp\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\rodsp\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\rodsp\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [8]:
import pandas as pd

df = pd.read_csv("alunos.csv", sep=";")
df

       RA     Nome  Frequência  Prova1  Prova2  Prova3  Prova4
0  110236  Adriana          20     8.0     8.0       8       8
1  110271    Maria          19     9.5     8.0       7      10
2  110263     José          20     5.0     6.5       7       5

In [9]:
df["Nome"]

0    Adriana
1      Maria
2       José
Name: Nome, dtype: object

In [10]:
df.columns

Index(['RA', 'Nome', 'Frequência', 'Prova1', 'Prova2', 'Prova3', 'Prova4'], dtype='object')

In [11]:
type(df)

pandas.core.frame.DataFrame

In [12]:
type(df["Nome"])

pandas.core.series.Series

In [13]:
df["Nome"].tolist()

['Adriana', 'Maria', 'José']

In [14]:
df2 = df[["Nome","Frequência"]]
df2

      Nome  Frequência
0  Adriana          20
1    Maria          19
2     José          20

In [15]:
df

       RA     Nome  Frequência  Prova1  Prova2  Prova3  Prova4
0  110236  Adriana          20     8.0     8.0       8       8
1  110271    Maria          19     9.5     8.0       7      10
2  110263     José          20     5.0     6.5       7       5

In [16]:
df2

      Nome  Frequência
0  Adriana          20
1    Maria          19
2     José          20

In [17]:
df.loc[1]

RA            110271
Nome           Maria
Frequência        19
Prova1           9.5
Prova2           8.0
Prova3             7
Prova4            10
Name: 1, dtype: object

In [18]:
df.loc[1,"Prova3"]

7

In [19]:
df.loc[1,"Prova3"] = 8.5
df.loc[1,"Prova3"]

8.5

In [20]:
df.loc[1]

RA            110271
Nome           Maria
Frequência        19
Prova1           9.5
Prova2           8.0
Prova3           8.5
Prova4            10
Name: 1, dtype: object

In [21]:
df["Nova coluna"] = "ADA"
df

       RA     Nome  Frequência  Prova1  Prova2  Prova3  Prova4 Nova coluna
0  110236  Adriana          20     8.0     8.0     8.0       8         ADA
1  110271    Maria          19     9.5     8.0     8.5      10         ADA
2  110263     José          20     5.0     6.5     7.0       5         ADA

In [22]:
# repete 10 vezes a geração de numeros aleatorios entre 0 e 10 

import random

[random.randint(0,10) for _ in range(10)]

[10, 1, 8, 9, 6, 10, 2, 9, 2, 3]

In [23]:
# cria coluna Prova5 com notas aleatorias

df["Prova5"] = [random.randint(0,10) for _ in range(3)]

df

,RA,Nome,Frequência,Prova1,Prova2,Prova3,Prova4,Nova coluna,Prova5
0,110236,Adriana,20,8.0,8.0,8.0,8,ADA,2
1,110271,Maria,19,9.5,8.0,8.5,10,ADA,6
2,110263,José,20,5.0,6.5,7.0,5,ADA,6

In [24]:
# retorma nimero de linhas e colunas no dataframe
df.shape

(3, 9)

In [25]:
# cria uma nova linha

df.loc[4, "RA"] = 110278
df.loc[4, "Nome"] = "Roberto"
df.loc[4, "Frequência"] = 18
df.loc[4, "Prova1"] = 7.5

In [26]:
df

,RA,Nome,Frequência,Prova1,Prova2,Prova3,Prova4,Nova coluna,Prova5
0,110236.0,Adriana,20.0,8.0,8.0,8.0,8.0,ADA,2.0
1,110271.0,Maria,19.0,9.5,8.0,8.5,10.0,ADA,6.0
2,110263.0,José,20.0,5.0,6.5,7.0,5.0,ADA,6.0
4,110278.0,Roberto,18.0,7.5,NaN,NaN,NaN,NaN,NaN

In [27]:
# apagar coluna sem salvar

# df.drop(columns=["Nova coluna"])

# apagar coluna salvando o dataframe

df = df.drop(columns=["Nova coluna"])

# equivalente
# df.drop(columns=["Nova coluna"], inplace = True)

In [28]:
df

         RA     Nome  Frequência  Prova1  Prova2  Prova3  Prova4  Prova5
0  110236.0  Adriana        20.0     8.0     8.0     8.0     8.0     2.0
1  110271.0    Maria        19.0     9.5     8.0     8.5    10.0     6.0
2  110263.0     José        20.0     5.0     6.5     7.0     5.0     6.0
4  110278.0  Roberto        18.0     7.5     NaN     NaN     NaN     NaN

In [29]:
# apagar linha sem salvar

# df.drop(index=[4])

# apagrar linha salvando no dataframe

df = df.drop(index=[4])
df

# equivalente
# df.drop(index[4], inplace=True)

         RA     Nome  Frequência  Prova1  Prova2  Prova3  Prova4  Prova5
0  110236.0  Adriana        20.0     8.0     8.0     8.0     8.0     2.0
1  110271.0    Maria        19.0     9.5     8.0     8.5    10.0     6.0
2  110263.0     José        20.0     5.0     6.5     7.0     5.0     6.0

In [30]:
# calcula média

(df["Prova1"] + df["Prova2"] + df["Prova3"] + df["Prova4"] + df["Prova5"])/5

0    6.8
1    8.4
2    5.9
dtype: float64

In [31]:
# cria coluna Média

df["Média"] = (df["Prova1"] + df["Prova2"] + df["Prova3"] + df["Prova4"] + df["Prova5"])/5
df

,RA,Nome,Frequência,Prova1,Prova2,Prova3,Prova4,Prova5,Média
0,110236.0,Adriana,20.0,8.0,8.0,8.0,8.0,2.0,6.8
1,110271.0,Maria,19.0,9.5,8.0,8.5,10.0,6.0,8.4
2,110263.0,José,20.0,5.0,6.5,7.0,5.0,6.0,5.9

In [32]:
# metodo info
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, 0 to 2
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   RA          3 non-null      float64
 1   Nome        3 non-null      object
 2   Frequência  3 non-null      float64
 3   Prova1      3 non-null      float64
 4   Prova2      3 non-null      float64
 5   Prova3      3 non-null      float64
 6   Prova4      3 non-null      float64
 7   Prova5      3 non-null      float64
 8   Média       3 non-null      float64
dtypes: float64(8), object(1)
memory usage: 240.0+ bytes

In [33]:
# calculando medias das colunas

df.columns # para copiar as colunas

Index(['RA', 'Nome', 'Frequência', 'Prova1', 'Prova2', 'Prova3', 'Prova4',
       'Prova5', 'Média'],
      dtype='object')

In [34]:
df[['Prova1', 'Prova2', 'Prova3', 'Prova4','Prova5']].mean(axis = 0)

Prova1    7.500000
Prova2    7.500000
Prova3    7.833333
Prova4    7.666667
Prova5    4.666667
dtype: float64

In [35]:
# calculando medias nas linhas

df[['Prova1', 'Prova2', 'Prova3', 'Prova4','Prova5']].mean(axis = 1)

0    6.8
1    8.4
2    5.9
dtype: float64

In [36]:
# Obter uma lista com as colunas para seleção e cópia
[col for col in df.columns if "Prova" in col]

['Prova1', 'Prova2', 'Prova3', 'Prova4', 'Prova5']

In [37]:
# Calculando medias nas colunas forma alternativa

df[[col for col in df.columns if "Prova" in col]].mean()

Prova1    7.500000
Prova2    7.500000
Prova3    7.833333
Prova4    7.666667
Prova5    4.666667
dtype: float64

In [38]:
# Calculando medias nas linhas forma alternativa

df[[col for col in df.columns if "Prova" in col]].mean(axis = 1)

0    6.8
1    8.4
2    5.9
dtype: float64

In [39]:
df["Média2"] = df[[col for col in df.columns if "Prova" in col]].mean(axis = 1)
df

,RA,Nome,Frequência,Prova1,Prova2,Prova3,Prova4,Prova5,Média,Média2
0,110236.0,Adriana,20.0,8.0,8.0,8.0,8.0,2.0,6.8,6.8
1,110271.0,Maria,19.0,9.5,8.0,8.5,10.0,6.0,8.4,8.4
2,110263.0,José,20.0,5.0,6.5,7.0,5.0,6.0,5.9,5.9

In [40]:
# filtrar dados: selecionar alunos com media maior que 7

df[df["Média"] > 7]

,RA,Nome,Frequência,Prova1,Prova2,Prova3,Prova4,Prova5,Média,Média2
1,110271.0,Maria,19.0,9.5,8.0,8.5,10.0,6.0,8.4,8.4

In [41]:
df["Média"] > 7

0    False
1     True
2    False
Name: Média, dtype: bool

In [42]:
# filtrar dados: selecionar alunos com media maior que 7 e frequencia menor que 20

df[(df["Média"] > 7) & (df["Frequência"] < 20)]

,RA,Nome,Frequência,Prova1,Prova2,Prova3,Prova4,Prova5,Média,Média2
1,110271.0,Maria,19.0,9.5,8.0,8.5,10.0,6.0,8.4,8.4

In [43]:
# filtrar dados: selecionar alunos com media não maior que 7 e frequencia não menor que 20

df[(~(df["Média"] > 7) & ~(df["Frequência"] < 20))]

,RA,Nome,Frequência,Prova1,Prova2,Prova3,Prova4,Prova5,Média,Média2
0,110236.0,Adriana,20.0,8.0,8.0,8.0,8.0,2.0,6.8,6.8
2,110263.0,José,20.0,5.0,6.5,7.0,5.0,6.0,5.9,5.9

In [44]:
# filtrar dados atraves de uma consulta query(): selecionar alunos com media maior que 7 e frequencia menor que 20

df.query("Média > 7 and Frequência < 20")

,RA,Nome,Frequência,Prova1,Prova2,Prova3,Prova4,Prova5,Média,Média2
1,110271.0,Maria,19.0,9.5,8.0,8.5,10.0,6.0,8.4,8.4

In [45]:
# filtrar dados atraves de uma consulta query(): selecionar alunos com media não maior que 7 e frequencia não menor que 20

df.query("not Média > 7 and not Frequência < 20")

,RA,Nome,Frequência,Prova1,Prova2,Prova3,Prova4,Prova5,Média,Média2
0,110236.0,Adriana,20.0,8.0,8.0,8.0,8.0,2.0,6.8,6.8
2,110263.0,José,20.0,5.0,6.5,7.0,5.0,6.0,5.9,5.9

In [46]:
# salvando o trabalha em arquivo csv separado por ; sem indice do dataframe

df.to_csv("alunos_processado.csv", sep=";",index=False )

In [47]:
# salvando o trabalha em arquivo csv separado por ; sem indice do dataframe filtrado

df.query("not Média > 7 and not Frequência < 20").to_csv("alunos_processado_fitrado.csv", sep=";",index=False )

# df_filtrado = df.query("not Média > 7 and not Frequência < 20")

# df_filtrado.to_csv("alunos_processado.csv", sep=";",index=False )

In [48]:
# salvando com outro formato pressionar tab no to para ver opções

df_filtrado = df.query("not Média > 7 and not Frequência < 20")

df_filtrado.to_excel("alunos_processado_fitrado.xlsx")

# em read_ pressionar tab para ver opções de arquivos para leitura

In [51]:
# criar dataframe a partir de um dicionario

cadastro = {"Nomes" : ["João","Mara","Marina"], "Idade" : [25, 20, 18], "Cidade" : ["São Paulo","Ubatuba","Bauru"], 
            "Filhos" : [0, 0, 0], "Altura" : [1.80, 1.65, 1.60]}

cadastro

{'Nomes': ['João', 'Mara', 'Marina'],
 'Idade': [25, 20, 18],
 'Cidade': ['São Paulo', 'Ubatuba', 'Bauru'],
 'Filhos': [0, 0, 0],
 'Altura': [1.8, 1.65, 1.6]}

In [52]:
pd.DataFrame(cadastro)

    Nomes  Idade     Cidade  Filhos  Altura
0    João     25  São Paulo       0    1.80
1    Mara     20    Ubatuba       0    1.65
2  Marina     18      Bauru       0    1.60

In [53]:
# criar dicionario a partir de um dataframe

df.to_dict()

{'RA': {0: 110236.0, 1: 110271.0, 2: 110263.0},
 'Nome': {0: 'Adriana', 1: 'Maria', 2: 'José'},
 'Frequência': {0: 20.0, 1: 19.0, 2: 20.0},
 'Prova1': {0: 8.0, 1: 9.5, 2: 5.0},
 'Prova2': {0: 8.0, 1: 8.0, 2: 6.5},
 'Prova3': {0: 8.0, 1: 8.5, 2: 7.0},
 'Prova4': {0: 8.0, 1: 10.0, 2: 5.0},
 'Prova5': {0: 2.0, 1: 6.0, 2: 6.0},
 'Média': {0: 6.8, 1: 8.4, 2: 5.9},
 'Média2': {0: 6.8, 1: 8.4, 2: 5.9}}